[
  {
    "id": "nitta_blog_about_me",
    "title": "About Me - y_nitta_dev ブログ",
    "url": "https://y-nitta-dev.blog/aboutme",
    "description": "保険営業からフリーランスWebエンジニアへの転身 - y.nitta ブログ。",
    "template": "NittaBlogPage",
    "content": {
      "title": "About Me",
      "publicDate": "2023-04-28",
      "content": {
        "chapters": [
          {
            "title": "はじめに",
            "content": "保険会社の営業として働き始めて1年が過ぎた頃、仕事自体にはやりがいを感じつつも、漠然とした違和感を抱えるようになりました。それが、フリーランスの道を選ぶきっかけです。"
          },
          {
            "title": "「形のないもの」を売ることへの葛藤",
            "content": "営業の仕事は、お客様の人生に寄り添う大切で尊い仕事だと理解していました。しかし、自分が提供している「保険」という商品は、どこまでいっても形のないサービスです。お客様から「ありがとう」と言われても、自分の仕事の成果が目に見える形で残らないことに、次第に物足りなさを感じるようになりました。\n\n大学祭の運営サークルで、何もない状態から企画を立て、仲間と協力して一つのイベントを創り上げた時の、あの「目に見える形になった瞬間」の達成感が忘れられなかったんです。自分の手で、何かを具体的に創り出す仕事がしたい、という想いが日に日に強くなっていきました。"
          },
          {
            "title": "業務で感じたITの重要性と非効率さ",
            "content": "営業活動で使っていた顧客管理システムが、正直とても使いにくかったんです。入力項目は複雑で、動作も遅い。「もっとこうだったら営業活動がスムーズになるのに」と感じる点がいくつもありました。\n\nその時、ふと「このシステムは、一体誰がどうやって作っているんだろう？」と興味が湧いたのが、プログラミングの世界を知る最初のきっかけです。調べていくうちに、世の中の便利なサービスの裏側には、すべてエンジニアの存在があることを知りました。お客様の課題を解決する、という点では保険の営業も同じですが、エンジニアは「ツールやサービスを創る」ことで、より直接的かつ大規模に課題を解決できる。その可能性に強く惹かれました。"
          },
          {
            "title": "「苦手を克服する」のではなく「好きを活かす」",
            "content": "高校時代、数学が苦手で文系に進んだ自分がエンジニアになるなんて、想像もしていませんでした。しかし、プログラミングの学習を始めてみると、それは高校数学のような抽象的なものではなく、「こう書けば、こう動く」という、まるで外国語のような明確なルールとロジックの世界でした。英語が比較的好きだった自分にとって、新しい言語を学び、それを使って何かを表現するプロセスは、驚くほど面白く感じられたんです。\n\n私は高校時代にワンダーフォーゲル部という少しニッチな部活に所属していました。私の高校のワンダーフォーゲル部はゆるく登山をするような部活だったのですが、事前にしっかり計画を立てることだけは抜かりなく行っていました。地図を読み解きながらルートを計画した時のように、論理的にゴールまでの道筋を考える作業は、実は自分に合っていたんだと気づきました。"
          },
          {
            "title": "自分の強みを活かせる働き方",
            "content": "1年10ヶ月という短い期間でしたが、営業として培った「お客様の課題をヒアリングし、解決策を提案する力」や、カフェのアルバイトで身につけた「相手の意図を汲み取るコミュニケーション能力」は、フリーランスとして活動する上で必ず活かせると考えました。\n\nクライアントが本当に作りたいものを正確に理解し、それを技術で形にする。それは、単にコードが書けるだけではできない、自分のこれまでの経験すべてを活かせる仕事だと思えたのです。\n\n会社に所属して経験を積む道も考えましたが、サークル運営で自分の裁量で動いた経験から、クライアントと直接対話し、責任をもって一つのものを創り上げるフリーランスという働き方に魅力を感じ、思い切って挑戦することに決めました。"
          },
          {
            "title": "現在のお仕事",
            "content": "現在はフリーランスのWebエンジニアとして、Webサイトや業務システムの受託開発をメインに活動しています。\n\n最初の仕事は、高校時代からの親友である橋本が立ち上げたアウトドア企画「KYET」の公式サイト制作と予約システムの構築でした。彼女が「ウチのサイト作ってみなよ！」と声をかけてくれたおかげで、未経験だった私がフリーランスとしての一歩を踏み出すことができ、この案件が今の私のキャリアの礎となっています。現在も「KYET」のサイト保守・改修を継続的に担当しており、事業の成長を技術面からサポートできることに、大きなやりがいを感じています。\n\nこの経験を元に、現在では個人事業主の方や中小企業様を中心に、想いや事業内容を丁寧にお聞きし、それをWebという形で表現するお手伝いをさせていただいております。"
          }
        ]
      },
      "tags": ["転職", "フリーランス", "保険営業", "Webエンジニア"],
      "author": {
        "name": "新田裕樹",
        "englishName": "Yuki Nitta",
        "title": "フリーランスWebエンジニア",
        "bio": "25歳で保険営業から未経験でWebエンジニアに転身。クライアントの想いを技術で実現できるようなエンジニアを目指しています。まだまだ駆け出しですが、日々精進...",
        "experience": "エンジニア歴 駆け出し",
        "techStack": "技術スタック：React, Next.js, TypeScript/JavaScript",
        "email": "yuki.nitta.1998@goggles.com"
      }
    },
    "keywords": [],
    "domainStatus": "expired",
    "archivedDate": "2024-01-06"
  }
]